Revit 2027 API
BuiltInFailures.StairRampFailures.CannotEndWithZeroRiser Property
 Can't end Stairs with Riser because Riser Thickness is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotEndWithZeroRiser { get; }
Public Shared ReadOnly Property CannotEndWithZeroRiser As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotEndWithZeroRiser {
	FailureDefinitionId^ get ();
}
static member CannotEndWithZeroRiser : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace